Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax_credits_and_reliefs/older_peoples_tax_credits_and_reliefs.html.txt.tmx
Source language: en
Languages: ga

source: Older people's tax credits and reliefs
ga: Cáin do dhaoine atá ós cionn 65

source: If you are aged 65 or over, you are liable to pay income tax in the normal way
ga: Má tá tú 65 nó ós a chionn, ní mór duit cáin a íoc ar ioncam ar an gnáthbhealach

source: However, there are tax exemption limits for people aged 65 or over and there are some extra tax credits
ga: Ach tá na teorainneacha díolúine i bhfad níos airde agus tá creidmheasanna cánacha sa bhreis ar fáil duit

source: It is possible to get tax relief for covenants to people aged 65 and over
ga: Is féidir faoiseamh ar cháin a fháil má chuirtear airgead ar fáil ar chúnant do dhuine atá 65 nó ós a chionn

source: In certain circumstances, you may be able to reclaim any DIRT (Deposit Interest Retention Tax) paid
ga: I gcásanna faoi leith, d'fhéadfadh sé go mbeadh tú in ann aon Cháin Choinneála ar Ús Taisce a d'íoc tú a fháil ar ais

source: Income tax applies to almost all income
ga: Baineann Cáin Ioncaim le nach mór chuile ioncam

source: People aged 65 and over are subject to the same general tax rules as everyone else but they do get tax exemption limits below which they pay no tax and some extra tax credits
ga: Tá cur síos sa mhír Cáin ar Phinsin ar an mbealach a ghearrtar cáin ar phinsin agus ar íocaíochtaí áirid eile leasa shóisialaigh

source: The way in which pensions and some other social welfare payments are taxed is described in our documents about taxation of pensions and taxation of social welfare payments
ga: Tá cur síos sna míreanna Pinsin Phearsanta agus Pinsin Cheirde ar an bhfaoiseamh cánach atá ar fáil do ranníocaíochtaí pinsin agus ar an gcóras cánach do phinsin phearsanta

source: The tax relief available for pension contributions and the tax treatment of personal pensions are described in Personal pensions and Occupational pensions
ga: Sa mhír Cáin agus Cúram Leighis déantar cur síos ar Chreidmheasanna Cánacha ar mhaithe le hárachas sláinte agus árachas cúraim fadthéarmaigh agus ar fhaoiseamh cánach ar son costais sláinte

source: Tax credits for health insurance and long-term care insurance and tax relief for medical expenses are described in our document about taxation and medical care
ga: Baineann na rialacha ginearálta cánacha le daoine atá 65 agus ós a chionn agus a bhaineann le chuile dhuine eile ach go bhfaigheann siad teorainneacha díolúine níos airde agus creidmheasanna breise cánacha

source: In general, if you are taxed exclusively under PAYE (this includes people whose non-PAYE income is taxed by having it coded into their determination of tax credits) you are not obliged to make an annual return
ga: Go ginearálta, más faoin gcóras ÍMAT amháin a ghearrtar cáin ort (daoine a bhfuil a n-ioncam neamh-ÍMAT dhá chódú isteach ina gcreidmheasanna cánacha san áireamh), ní gá duit tuairisc bhliantúil a chur chuig na Coimisinéirí Ioncaim

source: If you are not taxed under PAYE (i.e. you are taxed under the self-assessment system) you are obliged to make an annual return by 31 October each year
ga: Muna bhfuil cáin ÍMAT dhá íoc agat ní mór duit tuairisc bhliantúil a chur chuig na Coimisinéirí Iomcaim faoin 31 Deireadh Fómhair chuile bhliain

source: Exemption limits are income limits below which no tax is payable
ga: Níl aon cháin le n-íoc ag duine ar ioncam atá faoi na teorainneacha díolúine

source: Annual exemption limits for people aged 65 and over
ga: Seo a leanas na teorainneacha bliantúla do 2015

source: │Single or widowed or surviving │€18,000│
ga: │Duine Singil/ │€18,000 │

source: │Married or in a civil │€36,000│ │partnership │ │
ga: │Lanúin Phósta │€36,000 │

source: │First two children │€575 │
ga: │An chéad dá pháiste │€575 │

source: │Subsequent children │€830 │
ga: │Páistí eile │€830 an │

source: If you expect that your income for the year will be less than these limits, you should contact Revenue and they will issue a revised determination of tax credits to you
ga: Má cheapann tú go mbeidh ioncam agat faoi bhun na dteorainneacha seo ba cheart teagmháil a dhéanamh le na Coimisinéirí Ioncaim agus cuirfear amach fógra athbhreithnithe ar chreidmheasanna cánacha chugat

source: If your income is not much above these amounts, you may get what is called "marginal relief"
ga: Má tá d'ioncam beagainín níos airde ná na teorainneacha seo, d'fhéadfadh "faoiseamh imeallach" a bheith ar fáil duit

source: That means that you do not go back into the normal tax system - instead you pay tax at a rate of 40% on the amount by which your income exceeds your relevant exemption
ga: Má tá ní ghearrfar cáin ort faoin gnáthchóras cánach - ach íocfaidh tú cáin ag an ráta 40% ar an ioncam sa bhreis ar an teorainn díolúine

source: The point at which marginal relief ceases to be of benefit varies with your family circumstances and the tax credits to which you are entitled
ga: Braitheann an fiú duit faoiseamh imeallach a bheith agat ar do theaghlach féin agus ar na creidmheasanna cánacha a bhfuil tú ina dteideal

source: You can find more information about income tax exemptions and marginal relief on Revenue's website
ga: Tá tuilleadh eolais maidir le díolúine ó cháin agus faoiseamh cánach anseo

source: Tax credits are only relevant if you have a taxable income
ga: Tá creidmheasanna cánacha ar fáil anois in áit liúntais saor ó cháin

source: Tax credits reduce the amount of income tax that you have to pay
ga: Laghdófar do bhille iomlán cánach faoi na suimeanna seo

source: Everyone is entitled to a personal tax credit at either the married/in a civil partnership, single or widowed/surviving civil partner rate
ga: Tá gach duine i dteideal creidmheas pearsanta cánach ag an ráta pósta, singil nó baintrí

source: People who pay tax under the PAYE (pay-as-you-earn) system also get a PAYE tax credit
ga: Faigheann daoine a íocann cáin faoin gcóras ÍMAT creidmheas cánach ÍMAT freisin

source: This PAYE tax credit is also available to pensioners who receive their social security pension from another EU member state; they do not pay tax at source but pay tax annually
ga: Tá an creidmheas ÍMAT ar fáil freisin do phinsinéirí a fhaigheann pinsean árachais shóisialaigh ó bhall stáit eile den AE - ní íocann siad cáin ag an bhfoinse íocaíochta ach íocann siad cnapshuim go bliantúil

source: People aged 65 and over also get an Age Tax Credit
ga: Tá creidmheasanna cánacha ann a bhaineann le daoine atá ós cionn 65

source: This is additional to the personal tax credit and may be claimed once you or your spouse or civil partner reaches the age of 65
ga: Is féidir é seo a fháil sa bhreis ar an gcreidmheas pearsanta agus ní mór é a éileamh nuair a shroiceann tú nó do chéile 65

source: If you or your spouse or civil partner are 65 or over contact Revenue to claim this additional tax credit
ga: Má tá tusa nó do chéile 65 nó ós a chionn, ba cheart duit teagmháil a dhéanamh le na Coimisinéirí Ioncaim leis an gcreidmheas cánach breise seo a éileamh

source: Dependent Relative Tax Credit
ga: Creidmheas Cánach do Ghaol Cleithiúnach

source: This credit is granted to if you pay tax and maintain, at your own expense, any person who comes within any of the following categories:
ga: Tá an creidmheas seo ar fáil don cháiníocóir a chothaíonn, ar a c(h)ostas féin aon duine a thagann faoi na rannóga seo a leanas:

source: • A relative, including a relative of your spouse or civil partner, who is unable to maintain himself or herself as a result of old age or ill-health
ga: • Gaol an cháiníocóra nó a c(h)éile, nach féidir é/í féin a chothú de bharr seanaoise nó éagumais,

source: • A widowed parent / surviving civil partner parent of either yourself or your spouse or civil partner, irrespective of the state of his/her health
ga: • Máthair baintrí an cháiníocóra nó a c(h)éile má tá nó muna bhfuil éagumas uirthi

source: • A son or daughter of either yourself or your spouse or civil partner who lives with you and on whose services you must depend as a result of old age or ill health
ga: • Páiste (ag aon aois) an cháiníocóra nó a c(h)éile a chónaíonn leis an gcáiníocóir agus de bharr seanaoise nó éagumais a bhfuil an cáiníocóir ag brath air/uirthi

source: The relative's own income must be below a certain amount to claim this tax credit
ga: €70 an creidmheas cánach atá ar fáil sa bhliain 2013

source: More information is available in our document about dependent relative tax credit
ga: Leigh níos mó faoin Creidmheas Cánach do Ghaol Cleithiúnach anseo

source: Allowance for employing a carer
ga: Duine fostaithe atá ag breathnú i ndiaidh céile faoi éagumas

source: If you employ a person to take care of an incapacitated member of your family, you may get an additional allowance. The maximum allowance is €75,000
ga: Má fhostaíonn tú duine le breathnú i ndiaidh duine den teaghlach atá faoi éagumas d'fhéadfadh sé go mbeadh liúntas breise ar fáil duit €50,000

source: Relief for employing a carer is allowable at your highest rate of tax
ga: Tá tuilleadh eolais ar fáil ó na Coimisinéirí Ioncaim

source: If you are a higher rate taxpayer and you want to help support a person on a low income, it may be worthwhile to covenant the money
ga: Má íocann tú cáin ag an uas-ráta agus má theastaíonn uait tacaíocht a thabhairt do dhuine ar ioncam íseal, b'fhéidir gur fiú airgead a chur ar fháil dó/dí ar chúnant

source: The person to whom you covenant must be 65 or over or be permanently incapacitated
ga: Ní mór don duine a fhaigheann an t-airgead a bheith ós cionn 65 nó a bheith faoi éagumas go buan

source: If the conditions are met, you can claim tax relief on an amount up to 5% of your taxable income; however, there is no limit if the person is permanently incapacitated
ga: Má shásaíonn tú na rialacha is féidir leat faoiseamh cánach a éileamh ar suim nach mó ná 5% de d'ioncam inchánaithe, ach níl aon teorainn leis an suim má tá an faighteoir faoi éagumas buan

source: Covenants are most effective if the recipient does not have a taxable income
ga: Is fearr i bhfad cúnant a dhéanamh ar son duine nach bhfuil aon ioncam inchánaithe aige/aici

source: The amount you covenant may be taxable in the hands of the recipient
ga: D'fhéadfadh cáin a bheith le n-íoc ar an airgead ag an bhfaighteoir

source: It is important to note that money covenanted to people receiving a non-contributory pension or means-tested allowance may affect their entitlement to the allowance in question
ga: Tá sé tábhachtach smaoineamh go bhféadfadh airgead ar chúnant chuig duine atá ag fáil pinsin neamh-ranníocach nó liúntas lena mbaineann scrudú maoine cuir isteach ar na rialacha maoine a shásaigh siad sa chéad dul síos leis an liúntas sin a fháil

source: You can find more information about deeds of covenant
ga: Leigh níos mó faoi gníomhas chúnaint a dhéanamh anseo

source: Tax relief for rent
ga: Faoiseamh cánach i gcás cíos íoctha

source: This will be phased out over 7 years, starting from 2011. People over 55 can claim relief at higher rates. You cannot claim relief if you were not renting before 7 December 2010
ga: Is féidir le daoine atá 55 bliana d'aois agus os a chionn faoiseamh cánach 20% a fháil i gcás cíos a íocann siad ar chóiríocht phríobháideach ar chíos

source: You can find out more in our document about tax relief for private tenants
ga: Léigh tuilleadh faoi faoiseamh cánach le haghaidh tionóntaithe príobháideacha in Éirinn anseo

source: Deposit Interest Retention Tax
ga: Cáin Choinneála ar Ús Taisce

source: Deposit Interest Retention Tax (DIRT) is deducted from the interest payable on savings in banks, building societies, etc
ga: Baintear Cáin Choinneála ar Ús Taisce (DIRT) as an ús atá le n-íoc leat ar airgead i dtaisce i mbainc, cumainn fhoirgníochta, & rl

source: This happens whether or not you would normally be liable for tax
ga: Tarlaíonn seo fiú muna bhfuil cáin le n-íoc agat go hiondúil

source: If you are aged 65 or over or your spouse or civil partner is aged 65 or over or if you are permanently incapacitated, you may not be liable for DIRT if you are exempt from income tax
ga: Má tá tú 65 nó ós a chionn nó má tá do chéile 65 nó ós a chionn nó más duine faoi éagumas buan thú, d'fhéadfadh sé go mbeadh tú in ann an Cháin Choinneála ar Ús Taisce a éileamh ar ais muna bhfuil ioncam inchánaithe agat

source: You can notify your financial institution so that they can pay your interest without deducting DIRT
ga: Má tharlaíonn sé go bhfuil tú incháilithe le haisíocaíocht a fháil beidh tú in ann ó 2007 ar aghaidh é sin a insint do d'institiúid airgeadais agus beidh siad in ann do chuid úis a íoc gan DIRT a bhaint as

source: You can apply to your Inspector of Taxes for the credits described or for the application of the exemption limits to you
ga: Déan iarratas leis an gCigire Cánach ar son na gcreidmheasanna a bhfuil cur síos déanta orthu nó ar son na dteorainneacha díolúine a bhaineann leat

source: Forms for covenants are available from the Revenue Commissioners and in banks and other financial institutions
ga: Tá foirmeacha ar fáil ó na Coimisinéirí Ioncaim, sna bainc agus in institiúidí airgeadais eile ar mhaithe le cúnant a chur le chéile

source: You can use one of the lo-call telephone numbers to contact Revenue
ga: Uimhreacha ló-ghlaoch teileafóin do oifigí réigiúnach na gCoimisinéirí Ioncaim ar fáil anseo

source: You can find more detailed contact addresses for your region on Revenue's website
ga: Is féidir leat a thuilleadh leat a thuilleadh eolais a fháil faoi shonraí teagmhála do do réigiún anseo
